package com.sprint.mission.discodeit.service;

public interface UserService {

    /*
    - channels 관련
    - 채널 생성 메서드
        - 생성 후 자동적으로 가입이 되도록
    - 채널 가입 메서드
    - 가입한 채널 읽기(출력) 메서드
    - 채널 이름 수정 메서드
        - 해당 채널을 자신이 생성한 경우에만!
    - 채널 삭제 메서드
        - 해당 채널을 자신이 생성한 경우에만!
    - 채널 탈퇴 메서드
- messages 관련
    - 메세지 생성 메서드
        - 채널명을 함께 인자로 받아서 해당 채널에 메세지 생성
    - 자신이 작성한 메세지 읽기(출력) 메서드
    - 자신이 작성한 메세지 수정 메서드
    - 자신이 작성한 메세지 삭제 메서드
    - 생성, 읽기, 수정, 삭제 메서드?
- 후순위:
    - Friends 관련
        - 생성, 읽기, 수정, 삭제 메서드?
     */
}
